* DONE Wire Client
  :LOGBOOK:
  CLOCK: [2013-05-23 Thu 17:20]--[2013-05-23 Thu 18:11] =>  0:51
  CLOCK: [2013-05-23 Thu 14:00]--[2013-05-23 Thu 15:56] =>  1:56
  :END:
* DONE Better logging
  :LOGBOOK:
  CLOCK: [2013-05-25 Sat 20:19]--[2013-05-25 Sat 20:35] =>  0:16
  CLOCK: [2013-05-25 Sat 19:35]--[2013-05-25 Sat 20:19] =>  0:44
  :END:
  I think only the store is properly logged.  The network bits should
  be as well.
* DONE Store event interface
  :LOGBOOK:
  CLOCK: [2013-05-26 Sun 02:12]--[2013-05-26 Sun 02:23] =>  0:11
  CLOCK: [2013-05-25 Sat 22:26]--[2013-05-25 Sat 23:41] =>  1:15
  :END:
  Store should export some sort of event interface.  We need this both
  for the status plugin and for the node adapter.
* DONE Implement Simple.close
  :LOGBOOK:
  CLOCK: [2013-05-25 Sat 23:45]--[2013-05-25 Sat 23:53] =>  0:08
  :END:
* TODO Store statistics event-handler/adapter/server
* TODO Store exerciser
* TODO UDP Connections
  :LOGBOOK:
  CLOCK: [2013-05-23 Thu 13:48]--[2013-05-23 Thu 13:56] =>  0:08
  CLOCK: [2013-05-22 Wed 03:48]--[2013-05-22 Wed 03:58] =>  0:10
  CLOCK: [2013-05-05 Sun 23:13]--[2013-05-05 Sun 23:30] =>  0:17
  CLOCK: [2013-03-22 Fri 13:24]--[2013-03-22 Fri 13:34] =>  0:10
  CLOCK: [2013-03-21 Thu 17:40]--[2013-03-21 Thu 18:22] =>  0:42
  CLOCK: [2013-03-21 Thu 17:30]--[2013-03-21 Thu 17:34] =>  0:04
  :END:
* TODO UDP Maximum Sync
* TODO Better merging
* TODO Multi-entry changes
* TODO Temporal logic formalization
  Figure out what properties the whole thing should have, and what
  properties the individual components should have to be able to prove
  the bigger thing.
